articles/badguy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Being The Bad Guy</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">On Being The Bad Guy</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org32c9300">On Being The Bad Guy</a>
<ul>
<li><a href="#org8d8a698">A World of Good Guys</a></li>
<li><a href="#org68a2318">How It Feels to be Punched by Captain America</a></li>
<li><a href="#orgfd95e53">Just Another Body Swap Horror Plot</a></li>
<li><a href="#orgbf85636">Being the Bad Guy Isn't That Bad</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org32c9300" class="outline-1">
<h1 id="org32c9300">On Being The Bad Guy</h1>
<div class="outline-text-1" id="text-org32c9300">
<p>
Generally speaking, the audience is smarter than they are often given credit for. It is extremely rare for popular media to depict characters for which it is difficult to determine which characters are good and which characters are bad. By construction, there is a powerful looking guy on the cover, and he punches other guys &#x2013; those guys are the bad guys, and usually we are supposed to dislike them.
</p>

<p>
It usually helps if this guy is deformed or deranged in some way, to really sell that they are the <i>bad guy</i>. If they aren't, they usually need to be at least properly creepy or unsettling. If you do a poor job at this, you'll muddle the message. Sometimes the good guy is wrong about something, and sometimes the bad guy kind of has a point, but this critically must never be enough to confuse the audience about who is supposed to be good and who is supposed to be bad. Where the good guy lands is always the point, and anything convincing from the bad guy must either be misguided, "doing things the wrong way", or some sort of advanced sophistry where the bad guy tries to garner sympathy.
</p>

<p>
All of this is very simple.
</p>
</div>

<div id="outline-container-org8d8a698" class="outline-2">
<h2 id="org8d8a698">A World of Good Guys</h2>
<div class="outline-text-2" id="text-org8d8a698">
<p>
There is, of course, a small problem. Most people view themselves as the good guy, and view their enemies as the bad guys.
</p>

<p>
If you are a bad guy, this is bad news. The audience usually likes the good guy<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and for some reason they don't like you, even though you are the good guy. You are pretty sure this is because you are a temporarily embarrassed good guy, and you are just currently misunderstood. You're pretty sure you can think of some really huge examples where this happens in popular media, especially if you really think hard about it<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.  
</p>

<p>
Even worse, all those bad guys you keep running into seem to think <i>they're</i> the good guys. And the worst part is, everybody loves those guys. This is some advanced bad guy stuff, you think &#x2013; they've managed to brainwash the masses into turning against you. You plot and scheme (good guys do this, too) in an attempt to devise a method to win back the public, to wake them up to the truth that you are the good guy.
</p>

<p>
Ultimately all of this is in vain. There is a single thing which determines who the bad guy is: it's who the audience sees the good guy punching. 
</p>
</div>
</div>

<div id="outline-container-org68a2318" class="outline-2">
<h2 id="org68a2318">How It Feels to be Punched by Captain America</h2>
<div class="outline-text-2" id="text-org68a2318">
<p>
It does not feel good to be punched by Captain America.
</p>

<p>
Maybe you would have had a more detailed thought, but you're pretty sure you have a concussion (you know, from the punch). He seems to punch much harder than you do, which is sort of unusual, since you're the good guy and you're overwhelmingly supposed to <a href="https://tvtropes.org/pmwiki/pmwiki.php/Main/TheGoodGuysAlwaysWin">always win</a>.
</p>

<p>
There's a strong temptation here to use the strength of the punches as shorthand for who is the good guy and who is the bad guy. After all, even out here, in the real world, it says right here in the history books that the good guys have won every single war (what are the odds?)<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. Surely, with some logical step-by-step thinking, we can arrive at the conclusion that whoever punches the hardest must be the good guy.
</p>

<p>
Something about this feels sort of off to you, as you hurtle towards the floor after Steve's most recent killer right hook. This guy punching you was frail and weak before being roided out by the government or something, right? Was he more or less evil back then compared to now, where he's punching you (obviously, the good guy here)? Is it centrist to be weak instead of being slightly less strong?
</p>

<p>
The more you think about it, the less it really makes sense. It seems like how hard the punches are doesn't really have anything to do with who is right and who is wrong. Maybe. It's possible you're just coping about it. You are still pretty sure you are the good guy. You lose consciousness.
</p>
</div>
</div>

<div id="outline-container-orgfd95e53" class="outline-2">
<h2 id="orgfd95e53">Just Another Body Swap Horror Plot</h2>
<div class="outline-text-2" id="text-orgfd95e53">
<p>
You bolt up in a panic and it's worse than you thought &#x2013; you've woken up inside the body of another person. It is, of course, the person you dislike most in this world, the <i>real bad guy</i>.
</p>

<p>
You briefly consider your options. Harming yourself seems like an obviously bad idea, since who knows how long you will be stuck here. You quickly land upon the idea of turning yourself in, but then realize that you're not sure what that even means: currently it seems like the public believes you ("you") are the good guy, and it seems like you don't have any real way to convince them otherwise.
</p>

<p>
A knot develops in your stomach. It occurs to you that it's highly likely that the previous occupant of this body is out there somewhere running around in <i>your</i> body. Oh god, he's going to ruin everything. He might turn himself in, or worse, he might even hurt me. He thinks he's the <i>bad guy</i> now, and he was already bad enough before.
</p>

<p>
Luckily it turns out this new body of yours can punch pretty hard &#x2013; you should know, you've been punched by it. After a substantial amount of deliberation, you make it your new purpose to make sure that guy doesn't do bad stuff inside your old body. From the audience's perspective, very little has changed, but it's nice that they're randomly cheering for you now, even if they haven't really been vibing with the slightly different pre-fight banter recently. You smile. You were the good guy all along. 
</p>
</div>
</div>

<div id="outline-container-orgbf85636" class="outline-2">
<h2 id="orgbf85636">Being the Bad Guy Isn't That Bad</h2>
<div class="outline-text-2" id="text-orgbf85636">
<p>
The real secret here is that there are no such thing as good guys and bad guys. I made it all up, it turns out. We are not fictional characters: we are just people. Things don't happen according to storylines. Things <i>just happen</i>, and storylines are superimposed thing we use to make sense of those things that happen. I made a <a href="https://www.youtube.com/watch?v=Fg_7DcXwBlk">weird video</a> about this once, and even though I wrote it years ago, it still took me a really long time to really believe it deep down. Part of me still doesn't even really believe it &#x2013; a part of me that clings to my self-image as a hero, a perfectly moral being who is never wrong.
</p>

<p>
It took a lot of times being the bad guy before it really clicked for me that I was not the hero of reality, subject to frequent and devastating temporary embarrassment. It took many, many sleepless nights where it felt like everybody was just one blogpost away from <i>getting it</i>, from really understanding that I've been the good guy this whole time, that from my point of view the Jedi were evil. Sometimes you get to feel the joy of being the good guy, and sometimes you get punched by a beloved hero. It's nothing personal. 
</p>

<p>
In a lot of ways it's like how competitors will often mentally consider their "true skill level" their selective memory of all their most unbelievable successes, and write off all of the times they underperformed as being somehow anomalous and unrepresentative of how good they are. This is called the <a href="https://en.wikipedia.org/wiki/Availability_heuristic">availability heuristic</a>: a mental shortcut which basically says "if I can remember it, it must be more important than all those things I can't remember". A highlight reel of all our successes playing constantly on loop in our mind's eye; that time we won an important match, or the time we did something extra good at work. With such a view, how could it be possible for anybody to view themselves as anything <i>but</i> a hero? 
</p>

<p>
I do think there is maybe something worth examining in how social media perpetuates hero/villain narratives, about what they do to people's perceptions of right and wrong, the times where that feels potentially <a href="https://en.wikipedia.org/wiki/Gaza%E2%80%93Israel_conflict">really necessary</a> and the times where that feels <a href="https://liquipedia.net/smash/SSBMRank">really stupid</a>. But that's for a much longer and much more careful post, different from this one. For the most part, I think it's probably best to discard this hero/villain framework altogether; something at best useless and at worst actively harmful.
</p>

<p>
It's okay to embrace the risk of being the bad guy, sometimes. In the end, it's more important to do the thing you think is right, more than it is to do whatever you think the hero is "supposed to do".
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Some people like you, and you love them, but for some reason everybody keeps calling them weirdos and that makes you angry.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
You could probably think of this faster than <a href="https://www.youtube.com/watch?v=l24TjgdRNTU">Ludwig could think of 100 women</a>, at least. Good to have an upper bound on it.
p
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I've heard this joke attributed to Norm Macdonald but I can't find a source for this anywhere. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
